{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "signature": {"inputs": {"lstm_1_input": {"name": "lstm_1_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "9"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3200"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/output/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/output/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "lstm_1_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "9"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/Shape", "op": "Shape", "input": ["lstm_1_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/transpose", "op": "Transpose", "input": ["lstm_1_input", "StatefulPartitionedCall/sequential/lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm_1/Shape", "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm_1/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm_1/transpose", "StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm_1/strided_slice", "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm_1/strided_slice", "StatefulPartitionedCall/sequential/lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm_1/Shape_1", "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1/stack", "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "_has_manual_control_dependencies": {"b": true}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed", "StatefulPartitionedCall/sequential/lstm_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm_1/zeros/packed", "StatefulPartitionedCall/sequential/lstm_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/lstm_1/strided_slice_1"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/LoopControlInputs/_23", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential/lstm_1/zeros_1", "^StatefulPartitionedCall/sequential/lstm_1/zeros", "^StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/enter/_14", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/time", "^StatefulPartitionedCall/sequential/lstm_1/while/LoopControlInputs/_23"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/zeros_1", "^StatefulPartitionedCall/sequential/lstm_1/while/LoopControlInputs/_23"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/enter/_15", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential/lstm_1/while/LoopControlInputs/_23"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/strided_slice_1", "^StatefulPartitionedCall/sequential/lstm_1/while/LoopControlInputs/_23"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/enter/_12", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/loop_counter", "^StatefulPartitionedCall/sequential/lstm_1/while/LoopControlInputs/_23"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/enter/_13", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/maximum_iterations", "^StatefulPartitionedCall/sequential/lstm_1/while/LoopControlInputs/_23"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/zeros", "^StatefulPartitionedCall/sequential/lstm_1/while/LoopControlInputs/_23"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential/lstm_1/while/LoopControlInputs/_23"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/enter/_20", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/sequential/lstm_1/while/LoopControlInputs/_23"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/enter/_21", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential/lstm_1/while/LoopControlInputs/_23"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/enter/_22", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential/lstm_1/while/LoopControlInputs/_23"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/merge/_26", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/enter/_14", "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_53"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/enter/_17", "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_56"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/merge/_27", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/enter/_15", "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_54"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/enter/_18", "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_57"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/merge/_24", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/enter/_12", "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_51"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/merge/_25", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/enter/_13", "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_52"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/merge/_28", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/enter/_16", "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_55"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/enter/_19", "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_58"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/cond/_10/sequential/lstm_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/merge/_26", "StatefulPartitionedCall/sequential/lstm_1/while/merge/_30", "^StatefulPartitionedCall/sequential/lstm_1/while/merge/_31", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_20", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_21", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_22", "^StatefulPartitionedCall/sequential/lstm_1/while/merge/_24", "^StatefulPartitionedCall/sequential/lstm_1/while/merge/_25", "^StatefulPartitionedCall/sequential/lstm_1/while/merge/_27", "^StatefulPartitionedCall/sequential/lstm_1/while/merge/_28", "^StatefulPartitionedCall/sequential/lstm_1/while/merge/_29"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/LoopCond/_32", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/cond/_10/sequential/lstm_1/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2_1_switch/_36", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/merge/_27", "StatefulPartitionedCall/sequential/lstm_1/while/LoopCond/_32"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/strided_slice_1_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/merge/_30", "StatefulPartitionedCall/sequential/lstm_1/while/LoopCond/_32"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/while/loop_counter_switch/_33", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/merge/_24", "StatefulPartitionedCall/sequential/lstm_1/while/LoopCond/_32"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/while/maximum_iterations_switch/_34", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/merge/_25", "StatefulPartitionedCall/sequential/lstm_1/while/LoopCond/_32"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/zeros_1_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/merge/_29", "StatefulPartitionedCall/sequential/lstm_1/while/LoopCond/_32"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/merge/_31", "StatefulPartitionedCall/sequential/lstm_1/while/LoopCond/_32"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/zeros_switch/_37", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/merge/_28", "StatefulPartitionedCall/sequential/lstm_1/while/LoopCond/_32"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/time_switch/_35", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/merge/_26", "StatefulPartitionedCall/sequential/lstm_1/while/LoopCond/_32"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/exit/_45", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2_1_switch/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/strided_slice_1_switch/_39"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/exit/_42", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/while/loop_counter_switch/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/loop_body_control/_41", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/while/loop_counter_switch/_33:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/exit/_43", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/while/maximum_iterations_switch/_34"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/zeros_1_switch/_38"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/zeros_switch/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/exit/_44", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/time_switch/_35"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/exit/_45", "StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_40", "^StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2_1_switch/_36", "^StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/strided_slice_1_switch/_39", "^StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/time_switch/_35", "^StatefulPartitionedCall/sequential/lstm_1/while/loop_body_control/_41", "^StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/while/maximum_iterations_switch/_34", "^StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/zeros_1_switch/_38", "^StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/zeros_switch/_37", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_20", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_21", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_22"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/lstm_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_20"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split_1-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_21"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/Const_4", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/Const_5", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/clip_by_value_2/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/clip_by_value_2/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_20"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split_1-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_21"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/Const_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/Const_3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/clip_by_value_1/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/clip_by_value_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_20"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split_1-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_21"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/clip_by_value/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/clip_by_value/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input/_75", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/time_switch/_35:1", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split-folded-2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_20"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split_1-folded-2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_21"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input/_77", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/zeros_switch/_37:1", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/strided_slice_3", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm_1/while/enter/_22", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/strided_slice_1", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm_1/while/enter/_22", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/strided_slice", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm_1/while/enter/_22", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/strided_slice_2", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm_1/while/enter/_22", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/output_control_node/_95", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/lstm_1/while/enter/_20", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_21", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_22"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/lstm_1/while/enter/_20", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_21", "^StatefulPartitionedCall/sequential/lstm_1/while/enter/_22"], "attr": {"_acd_function_control_output": {"b": true}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential/lstm_1/transpose_1", "StatefulPartitionedCall/sequential/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/while/loop_counter_switch/_33:1", "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input/_75", "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_40:1", "Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input/_75", "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/MatMul_7", "op": "MatMul", "input": ["Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input/_77", "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/strided_slice_3"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/MatMul_5", "op": "MatMul", "input": ["Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input/_77", "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/strided_slice_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/MatMul_4", "op": "MatMul", "input": ["Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input/_77", "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/strided_slice"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/MatMul_6", "op": "MatMul", "input": ["Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input/_77", "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/strided_slice_2"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_57", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/strided_slice_1_switch/_39:1", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/output_control_node/_95", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_58", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_40:1", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/output_control_node/_95", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_52", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/StatefulPartitionedCall/sequential/lstm_1/while/maximum_iterations_switch/_34:1", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/output_control_node/_95", "^StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/NoOp", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/input_control_node/_72"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/flatten/Reshape", "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_51", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/add_1", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/output_control_node/_95", "^StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/next_iteration/_53", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/add", "^Func/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/output_control_node/_95", "^StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/BiasAdd_3", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split-folded-3", "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split_1-folded-3"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/BiasAdd_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split-folded-1", "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split_1-folded-1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split-folded-0", "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split_1-folded-0"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/BiasAdd_2", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split-folded-2", "ConstantFolding/StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/split_1-folded-2"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/output/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense_1/Relu", "StatefulPartitionedCall/sequential/output/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/output/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/add_6", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/BiasAdd_3", "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/MatMul_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/BiasAdd_1", "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/MatMul_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/BiasAdd", "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/MatMul_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/add_4", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm_1/while/body/_11/sequential/lstm_1/while/lstm_cell/BiasAdd_2", 